---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceOffsetFromSurface
source: html/0b71f32d-a8f0-af96-d370-9cedc66c9dba.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceOffsetFromSurface Property

"Offset from surface"

## Syntax (C#)
```csharp
public static ForgeTypeId DividedSurfaceOffsetFromSurface { get; }
```